## <span style="text-transform:uppercase">production</span> Module: etl_lambdas
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 6 to add, 3 to change, 0 to destroy
```

<details>
  <summary>Show Plan</summary>

  ```terraform
  module.unmasked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/unmasked_metrics]
module.masked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/masked_metrics]
aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]
aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]
module.unmasked_metrics.aws_lambda_function.lambda: Refreshing state... [id=unmasked_metrics]
module.masked_metrics.aws_lambda_function.lambda: Refreshing state... [id=masked_metrics]
aws_iam_policy.etl_policies: Refreshing state... [id=arn:aws:iam::820252213580:policy/EtlLambdaAccess]
aws_cloudwatch_event_target.tigger-masked_metrics: Refreshing state... [id=twice-a-day-masked_metrics]
aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.tigger-unmasked_metrics: Refreshing state... [id=twice-a-day-unmasked_metrics]
aws_iam_role_policy_attachment.etl_policies: Refreshing state... [id=metrics_csv_lambda_role-20210519202244195100000001]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.etl_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "etl_policies"  {
      ~ id      = "2386433082" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:ConditionCheckItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
              + "elasticfilesystem:DescribeMountTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.etl_policies will be updated in-place
  ~ resource "aws_iam_policy" "etl_policies" {
        id        = "arn:aws:iam::820252213580:policy/EtlLambdaAccess"
        name      = "EtlLambdaAccess"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:ConditionCheckItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.masked_metrics.aws_efs_access_point.access_point_for_lambda will be created
  + resource "aws_efs_access_point" "access_point_for_lambda" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = (known after apply)

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "777"
            }
        }
    }

  # module.masked_metrics.aws_efs_file_system.efs_for_lambda will be created
  + resource "aws_efs_file_system" "efs_for_lambda" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "masked_metrics_efs"
        }
      + tags_all                = {
          + "Name" = "masked_metrics_efs"
        }
      + throughput_mode         = "bursting"
    }

  # module.masked_metrics.aws_efs_mount_target.mt will be created
  + resource "aws_efs_mount_target" "mt" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0b77afa7e1b78c3c2",
        ]
      + subnet_id              = "subnet-06fcfc328ffe9f5d0"
    }

  # module.masked_metrics.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "masked_metrics"
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TMP_PATH"    = "/mnt/efs"
                # (3 unchanged elements hidden)
            }
        }

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }


        # (2 unchanged blocks hidden)
    }

  # module.unmasked_metrics.aws_efs_access_point.access_point_for_lambda will be created
  + resource "aws_efs_access_point" "access_point_for_lambda" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = (known after apply)

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "777"
            }
        }
    }

  # module.unmasked_metrics.aws_efs_file_system.efs_for_lambda will be created
  + resource "aws_efs_file_system" "efs_for_lambda" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "unmasked_metrics_efs"
        }
      + tags_all                = {
          + "Name" = "unmasked_metrics_efs"
        }
      + throughput_mode         = "bursting"
    }

  # module.unmasked_metrics.aws_efs_mount_target.mt will be created
  + resource "aws_efs_mount_target" "mt" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0b77afa7e1b78c3c2",
        ]
      + subnet_id              = "subnet-06fcfc328ffe9f5d0"
    }

  # module.unmasked_metrics.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "unmasked_metrics"
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TMP_PATH"    = "/mnt/efs"
                # (3 unchanged elements hidden)
            }
        }

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }


        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
  ```
</details>